Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/include/proc/p32mz2064dah176.h
extern volatile __ADCDSTAT2bits_t ADCDSTAT2bits __asm__ ("ADCDSTAT2") __attribute__((section("sfrs"), address(0xBF84B034)));
#define ADCCMPEN1 ADCCMPEN1
extern volatile uint32_t   ADCCMPEN1 __attribute__((section("sfrs"), address(0xBF84B038)));
typedef struct {
  uint32_t CMPE0:1;
  uint32_t CMPE1:1;
  uint32_t CMPE2:1;
  uint32_t CMPE3:1;
  uint32_t CMPE4:1;
  uint32_t CMPE5:1;
  uint32_t CMPE6:1;
  uint32_t CMPE7:1;
  uint32_t CMPE8:1;
  uint32_t CMPE9:1;
  uint32_t CMPE10:1;
  uint32_t CMPE11:1;
  uint32_t CMPE12:1;
  uint32_t CMPE13:1;
  uint32_t CMPE14:1;
  uint32_t CMPE15:1;
  uint32_t CMPE16:1;
  uint32_t CMPE17:1;
  uint32_t CMPE18:1;
  uint32_t CMPE19:1;
  uint32_t CMPE20:1;
  uint32_t CMPE21:1;
  uint32_t CMPE22:1;
  uint32_t CMPE23:1;
  uint32_t CMPE24:1;
  uint32_t CMPE25:1;
  uint32_t CMPE26:1;
  uint32_t CMPE27:1;
  uint32_t CMPE28:1;
  uint32_t CMPE29:1;
  uint32_t CMPE30:1;
  uint32_t CMPE31:1;
} __ADCCMPEN1bits_t;
extern volatile __ADCCMPEN1bits_t ADCCMPEN1bits __asm__ ("ADCCMPEN1") __attribute__((section("sfrs"), address(0xBF84B038)));
#define ADCCMP1 ADCCMP1
extern volatile uint32_t   ADCCMP1 __attribute__((section("sfrs"), address(0xBF84B03C)));
typedef struct {
  uint32_t DCMPLO:16;
  uint32_t DCMPHI:16;
} __ADCCMP1bits_t;
extern volatile __ADCCMP1bits_t ADCCMP1bits __asm__ ("ADCCMP1") __attribute__((section("sfrs"), address(0xBF84B03C)));
#define ADCCMPEN2 ADCCMPEN2
extern volatile uint32_t   ADCCMPEN2 __attribute__((section("sfrs"), address(0xBF84B040)));
typedef struct {
  uint32_t CMPE0:1;
  uint32_t CMPE1:1;
  uint32_t CMPE2:1;
  uint32_t CMPE3:1;
  uint32_t CMPE4:1;
  uint32_t CMPE5:1;
  uint32_t CMPE6:1;
  uint32_t CMPE7:1;
  uint32_t CMPE8:1;
  uint32_t CMPE9:1;
  uint32_t CMPE10:1;
  uint32_t CMPE11:1;
  uint32_t CMPE12:1;
  uint32_t CMPE13:1;
  uint32_t CMPE14:1;
  uint32_t CMPE15:1;
  uint32_t CMPE16:1;
  uint32_t CMPE17:1;
  uint32_t CMPE18:1;
  uint32_t CMPE19:1;
  uint32_t CMPE20:1;
  uint32_t CMPE21:1;
  uint32_t CMPE22:1;
  uint32_t CMPE23:1;
  uint32_t CMPE24:1;
  uint32_t CMPE25:1;
  uint32_t CMPE26:1;
  uint32_t CMPE27:1;
  uint32_t CMPE28:1;
  uint32_t CMPE29:1;
  uint32_t CMPE30:1;
  uint32_t CMPE31:1;
} __ADCCMPEN2bits_t;
extern volatile __ADCCMPEN2bits_t ADCCMPEN2bits __asm__ ("ADCCMPEN2") __attribute__((section("sfrs"), address(0xBF84B040)));
#define ADCCMP2 ADCCMP2
extern volatile uint32_t   ADCCMP2 __attribute__((section("sfrs"), address(0xBF84B044)));
typedef struct {
  uint32_t DCMPLO:16;
  uint32_t DCMPHI:16;
} __ADCCMP2bits_t;
extern volatile __ADCCMP2bits_t ADCCMP2bits __asm__ ("ADCCMP2") __attribute__((section("sfrs"), address(0xBF84B044)));
#define ADCCMPEN3 ADCCMPEN3
extern volatile uint32_t   ADCCMPEN3 __attribute__((section("sfrs"), address(0xBF84B048)));
typedef struct {
  uint32_t CMPE0:1;
  uint32_t CMPE1:1;
  uint32_t CMPE2:1;
  uint32_t CMPE3:1;
  uint32_t CMPE4:1;
  uint32_t CMPE5:1;
  uint32_t CMPE6:1;
  uint32_t CMPE7:1;
  uint32_t CMPE8:1;
  uint32_t CMPE9:1;
  uint32_t CMPE10:1;
  uint32_t CMPE11:1;
  uint32_t CMPE12:1;
  uint32_t CMPE13:1;
  uint32_t CMPE14:1;
  uint32_t CMPE15:1;
  uint32_t CMPE16:1;
  uint32_t CMPE17:1;
  uint32_t CMPE18:1;
  uint32_t CMPE19:1;
  uint32_t CMPE20:1;
  uint32_t CMPE21:1;
  uint32_t CMPE22:1;
  uint32_t CMPE23:1;
  uint32_t CMPE24:1;
  uint32_t CMPE25:1;
  uint32_t CMPE26:1;
  uint32_t CMPE27:1;
  uint32_t CMPE28:1;
  uint32_t CMPE29:1;
  uint32_t CMPE30:1;
  uint32_t CMPE31:1;
} __ADCCMPEN3bits_t;
extern volatile __ADCCMPEN3bits_t ADCCMPEN3bits __asm__ ("ADCCMPEN3") __attribute__((section("sfrs"), address(0xBF84B048)));
#define ADCCMP3 ADCCMP3
extern volatile uint32_t   ADCCMP3 __attribute__((section("sfrs"), address(0xBF84B04C)));
typedef struct {
  uint32_t DCMPLO:16;
  uint32_t DCMPHI:16;
} __ADCCMP3bits_t;
extern volatile __ADCCMP3bits_t ADCCMP3bits __asm__ ("ADCCMP3") __attribute__((section("sfrs"), address(0xBF84B04C)));
#define ADCCMPEN4 ADCCMPEN4
extern volatile uint32_t   ADCCMPEN4 __attribute__((section("sfrs"), address(0xBF84B050)));
typedef struct {
  uint32_t CMPE0:1;
  uint32_t CMPE1:1;
  uint32_t CMPE2:1;
  uint32_t CMPE3:1;
  uint32_t CMPE4:1;
  uint32_t CMPE5:1;
  uint32_t CMPE6:1;
  uint32_t CMPE7:1;
  uint32_t CMPE8:1;
  uint32_t CMPE9:1;
  uint32_t CMPE10:1;
  uint32_t CMPE11:1;
  uint32_t CMPE12:1;
  uint32_t CMPE13:1;
  uint32_t CMPE14:1;
  uint32_t CMPE15:1;
  uint32_t CMPE16:1;
  uint32_t CMPE17:1;
  uint32_t CMPE18:1;
  uint32_t CMPE19:1;
  uint32_t CMPE20:1;
  uint32_t CMPE21:1;
  uint32_t CMPE22:1;
  uint32_t CMPE23:1;
  uint32_t CMPE24:1;
  uint32_t CMPE25:1;
  uint32_t CMPE26:1;
  uint32_t CMPE27:1;
  uint32_t CMPE28:1;
  uint32_t CMPE29:1;
  uint32_t CMPE30:1;
  uint32_t CMPE31:1;
} __ADCCMPEN4bits_t;
extern volatile __ADCCMPEN4bits_t ADCCMPEN4bits __asm__ ("ADCCMPEN4") __attribute__((section("sfrs"), address(0xBF84B050)));
#define ADCCMP4 ADCCMP4
extern volatile uint32_t   ADCCMP4 __attribute__((section("sfrs"), address(0xBF84B054)));
typedef struct {
  uint32_t DCMPLO:16;
  uint32_t DCMPHI:16;
} __ADCCMP4bits_t;
extern volatile __ADCCMP4bits_t ADCCMP4bits __asm__ ("ADCCMP4") __attribute__((section("sfrs"), address(0xBF84B054)));
#define ADCCMPEN5 ADCCMPEN5
extern volatile uint32_t   ADCCMPEN5 __attribute__((section("sfrs"), address(0xBF84B058)));
typedef struct {
  uint32_t CMPE0:1;
  uint32_t CMPE1:1;
  uint32_t CMPE2:1;
  uint32_t CMPE3:1;
  uint32_t CMPE4:1;
  uint32_t CMPE5:1;
  uint32_t CMPE6:1;
  uint32_t CMPE7:1;
  uint32_t CMPE8:1;
  uint32_t CMPE9:1;
  uint32_t CMPE10:1;
  uint32_t CMPE11:1;
  uint32_t CMPE12:1;
  uint32_t CMPE13:1;
  uint32_t CMPE14:1;
  uint32_t CMPE15:1;
  uint32_t CMPE16:1;
  uint32_t CMPE17:1;
  uint32_t CMPE18:1;
  uint32_t CMPE19:1;
  uint32_t CMPE20:1;
  uint32_t CMPE21:1;
  uint32_t CMPE22:1;
  uint32_t CMPE23:1;
  uint32_t CMPE24:1;
  uint32_t CMPE25:1;
  uint32_t CMPE26:1;
  uint32_t CMPE27:1;
  uint32_t CMPE28:1;
  uint32_t CMPE29:1;
  uint32_t CMPE30:1;
  uint32_t CMPE31:1;
} __ADCCMPEN5bits_t;
extern volatile __ADCCMPEN5bits_t ADCCMPEN5bits __asm__ ("ADCCMPEN5") __attribute__((section("sfrs"), address(0xBF84B058)));
#define ADCCMP5 ADCCMP5
extern volatile uint32_t   ADCCMP5 __attribute__((section("sfrs"), address(0xBF84B05C)));
typedef struct {
  uint32_t DCMPLO:16;
  uint32_t DCMPHI:16;
} __ADCCMP5bits_t;
extern volatile __ADCCMP5bits_t ADCCMP5bits __asm__ ("ADCCMP5") __attribute__((section("sfrs"), address(0xBF84B05C)));
#define ADCCMPEN6 ADCCMPEN6
extern volatile uint32_t   ADCCMPEN6 __attribute__((section("sfrs"), address(0xBF84B060)));
typedef struct {
  uint32_t CMPE0:1;
  uint32_t CMPE1:1;
  uint32_t CMPE2:1;
  uint32_t CMPE3:1;
  uint32_t CMPE4:1;
  uint32_t CMPE5:1;
  uint32_t CMPE6:1;
  uint32_t CMPE7:1;
  uint32_t CMPE8:1;
  uint32_t CMPE9:1;
  uint32_t CMPE10:1;
  uint32_t CMPE11:1;
  uint32_t CMPE12:1;
  uint32_t CMPE13:1;
  uint32_t CMPE14:1;
  uint32_t CMPE15:1;
  uint32_t CMPE16:1;
  uint32_t CMPE17:1;
  uint32_t CMPE18:1;
  uint32_t CMPE19:1;
  uint32_t CMPE20:1;
  uint32_t CMPE21:1;
  uint32_t CMPE22:1;
  uint32_t CMPE23:1;
  uint32_t CMPE24:1;
  uint32_t CMPE25:1;
  uint32_t CMPE26:1;
  uint32_t CMPE27:1;
  uint32_t CMPE28:1;
  uint32_t CMPE29:1;
  uint32_t CMPE30:1;
  uint32_t CMPE31:1;
} __ADCCMPEN6bits_t;
