Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/include/proc/p32mz2064dah176.h
extern volatile __SBT10REG0bits_t SBT10REG0bits __asm__ ("SBT10REG0") __attribute__((section("sfrs"), address(0xBF909040)));
#define SBT10RD0 SBT10RD0
extern volatile uint32_t   SBT10RD0 __attribute__((section("sfrs"), address(0xBF909050)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT10RD0bits_t;
extern volatile __SBT10RD0bits_t SBT10RD0bits __asm__ ("SBT10RD0") __attribute__((section("sfrs"), address(0xBF909050)));
#define SBT10WR0 SBT10WR0
extern volatile uint32_t   SBT10WR0 __attribute__((section("sfrs"), address(0xBF909058)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT10WR0bits_t;
extern volatile __SBT10WR0bits_t SBT10WR0bits __asm__ ("SBT10WR0") __attribute__((section("sfrs"), address(0xBF909058)));
#define SBT10REG1 SBT10REG1
extern volatile uint32_t   SBT10REG1 __attribute__((section("sfrs"), address(0xBF909060)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT10REG1bits_t;
extern volatile __SBT10REG1bits_t SBT10REG1bits __asm__ ("SBT10REG1") __attribute__((section("sfrs"), address(0xBF909060)));
#define SBT10RD1 SBT10RD1
extern volatile uint32_t   SBT10RD1 __attribute__((section("sfrs"), address(0xBF909070)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT10RD1bits_t;
extern volatile __SBT10RD1bits_t SBT10RD1bits __asm__ ("SBT10RD1") __attribute__((section("sfrs"), address(0xBF909070)));
#define SBT10WR1 SBT10WR1
extern volatile uint32_t   SBT10WR1 __attribute__((section("sfrs"), address(0xBF909078)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT10WR1bits_t;
extern volatile __SBT10WR1bits_t SBT10WR1bits __asm__ ("SBT10WR1") __attribute__((section("sfrs"), address(0xBF909078)));
#define SBT11ELOG1 SBT11ELOG1
extern volatile uint32_t   SBT11ELOG1 __attribute__((section("sfrs"), address(0xBF909420)));
typedef struct {
  uint32_t CMD:3;
  uint32_t :1;
  uint32_t REGION:4;
  uint32_t INITID:8;
  uint32_t :8;
  uint32_t CODE:4;
  uint32_t :3;
  uint32_t MULTI:1;
} __SBT11ELOG1bits_t;
extern volatile __SBT11ELOG1bits_t SBT11ELOG1bits __asm__ ("SBT11ELOG1") __attribute__((section("sfrs"), address(0xBF909420)));
#define SBT11ELOG2 SBT11ELOG2
extern volatile uint32_t   SBT11ELOG2 __attribute__((section("sfrs"), address(0xBF909424)));
typedef struct {
  uint32_t GROUP:2;
} __SBT11ELOG2bits_t;
extern volatile __SBT11ELOG2bits_t SBT11ELOG2bits __asm__ ("SBT11ELOG2") __attribute__((section("sfrs"), address(0xBF909424)));
#define SBT11ECON SBT11ECON
extern volatile uint32_t   SBT11ECON __attribute__((section("sfrs"), address(0xBF909428)));
typedef struct {
  uint32_t :24;
  uint32_t ERRP:1;
} __SBT11ECONbits_t;
extern volatile __SBT11ECONbits_t SBT11ECONbits __asm__ ("SBT11ECON") __attribute__((section("sfrs"), address(0xBF909428)));
#define SBT11ECLRS SBT11ECLRS
extern volatile uint32_t   SBT11ECLRS __attribute__((section("sfrs"), address(0xBF909430)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT11ECLRSbits_t;
extern volatile __SBT11ECLRSbits_t SBT11ECLRSbits __asm__ ("SBT11ECLRS") __attribute__((section("sfrs"), address(0xBF909430)));
#define SBT11ECLRM SBT11ECLRM
extern volatile uint32_t   SBT11ECLRM __attribute__((section("sfrs"), address(0xBF909438)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT11ECLRMbits_t;
extern volatile __SBT11ECLRMbits_t SBT11ECLRMbits __asm__ ("SBT11ECLRM") __attribute__((section("sfrs"), address(0xBF909438)));
#define SBT11REG0 SBT11REG0
extern volatile uint32_t   SBT11REG0 __attribute__((section("sfrs"), address(0xBF909440)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT11REG0bits_t;
extern volatile __SBT11REG0bits_t SBT11REG0bits __asm__ ("SBT11REG0") __attribute__((section("sfrs"), address(0xBF909440)));
#define SBT11RD0 SBT11RD0
extern volatile uint32_t   SBT11RD0 __attribute__((section("sfrs"), address(0xBF909450)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT11RD0bits_t;
extern volatile __SBT11RD0bits_t SBT11RD0bits __asm__ ("SBT11RD0") __attribute__((section("sfrs"), address(0xBF909450)));
#define SBT11WR0 SBT11WR0
extern volatile uint32_t   SBT11WR0 __attribute__((section("sfrs"), address(0xBF909458)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT11WR0bits_t;
extern volatile __SBT11WR0bits_t SBT11WR0bits __asm__ ("SBT11WR0") __attribute__((section("sfrs"), address(0xBF909458)));
#define SBT11REG1 SBT11REG1
extern volatile uint32_t   SBT11REG1 __attribute__((section("sfrs"), address(0xBF909460)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT11REG1bits_t;
extern volatile __SBT11REG1bits_t SBT11REG1bits __asm__ ("SBT11REG1") __attribute__((section("sfrs"), address(0xBF909460)));
#define SBT11RD1 SBT11RD1
extern volatile uint32_t   SBT11RD1 __attribute__((section("sfrs"), address(0xBF909470)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT11RD1bits_t;
extern volatile __SBT11RD1bits_t SBT11RD1bits __asm__ ("SBT11RD1") __attribute__((section("sfrs"), address(0xBF909470)));
#define SBT11WR1 SBT11WR1
extern volatile uint32_t   SBT11WR1 __attribute__((section("sfrs"), address(0xBF909478)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT11WR1bits_t;
extern volatile __SBT11WR1bits_t SBT11WR1bits __asm__ ("SBT11WR1") __attribute__((section("sfrs"), address(0xBF909478)));
#define SBT12ELOG1 SBT12ELOG1
extern volatile uint32_t   SBT12ELOG1 __attribute__((section("sfrs"), address(0xBF909820)));
typedef struct {
  uint32_t CMD:3;
  uint32_t :1;
  uint32_t REGION:4;
  uint32_t INITID:8;
  uint32_t :8;
  uint32_t CODE:4;
  uint32_t :3;
  uint32_t MULTI:1;
} __SBT12ELOG1bits_t;
extern volatile __SBT12ELOG1bits_t SBT12ELOG1bits __asm__ ("SBT12ELOG1") __attribute__((section("sfrs"), address(0xBF909820)));
#define SBT12ELOG2 SBT12ELOG2
extern volatile uint32_t   SBT12ELOG2 __attribute__((section("sfrs"), address(0xBF909824)));
typedef struct {
  uint32_t GROUP:2;
} __SBT12ELOG2bits_t;
extern volatile __SBT12ELOG2bits_t SBT12ELOG2bits __asm__ ("SBT12ELOG2") __attribute__((section("sfrs"), address(0xBF909824)));
#define SBT12ECON SBT12ECON
extern volatile uint32_t   SBT12ECON __attribute__((section("sfrs"), address(0xBF909828)));
typedef struct {
  uint32_t :24;
  uint32_t ERRP:1;
} __SBT12ECONbits_t;
extern volatile __SBT12ECONbits_t SBT12ECONbits __asm__ ("SBT12ECON") __attribute__((section("sfrs"), address(0xBF909828)));
#define SBT12ECLRS SBT12ECLRS
extern volatile uint32_t   SBT12ECLRS __attribute__((section("sfrs"), address(0xBF909830)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT12ECLRSbits_t;
extern volatile __SBT12ECLRSbits_t SBT12ECLRSbits __asm__ ("SBT12ECLRS") __attribute__((section("sfrs"), address(0xBF909830)));
#define SBT12ECLRM SBT12ECLRM
extern volatile uint32_t   SBT12ECLRM __attribute__((section("sfrs"), address(0xBF909838)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT12ECLRMbits_t;
extern volatile __SBT12ECLRMbits_t SBT12ECLRMbits __asm__ ("SBT12ECLRM") __attribute__((section("sfrs"), address(0xBF909838)));
#define SBT12REG0 SBT12REG0
extern volatile uint32_t   SBT12REG0 __attribute__((section("sfrs"), address(0xBF909840)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT12REG0bits_t;
