Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/include/proc/p32mz2064dah176.h
#define _DDRCMD212_MDADDRHCMD_POSITION           0x00000000
#define _DDRCMD212_MDADDRHCMD_MASK               0x000000FF
#define _DDRCMD212_MDADDRHCMD_LENGTH             0x00000008

#define _DDRCMD212_BNKADDRCMD_POSITION           0x00000008
#define _DDRCMD212_BNKADDRCMD_MASK               0x00000700
#define _DDRCMD212_BNKADDRCMD_LENGTH             0x00000003

#define _DDRCMD212_WAIT_POSITION                 0x0000000B
#define _DDRCMD212_WAIT_MASK                     0x000FF800
#define _DDRCMD212_WAIT_LENGTH                   0x00000009

#define _DDRCMD213_MDADDRHCMD_POSITION           0x00000000
#define _DDRCMD213_MDADDRHCMD_MASK               0x000000FF
#define _DDRCMD213_MDADDRHCMD_LENGTH             0x00000008

#define _DDRCMD213_BNKADDRCMD_POSITION           0x00000008
#define _DDRCMD213_BNKADDRCMD_MASK               0x00000700
#define _DDRCMD213_BNKADDRCMD_LENGTH             0x00000003

#define _DDRCMD213_WAIT_POSITION                 0x0000000B
#define _DDRCMD213_WAIT_MASK                     0x000FF800
#define _DDRCMD213_WAIT_LENGTH                   0x00000009

#define _DDRCMD214_MDADDRHCMD_POSITION           0x00000000
#define _DDRCMD214_MDADDRHCMD_MASK               0x000000FF
#define _DDRCMD214_MDADDRHCMD_LENGTH             0x00000008

#define _DDRCMD214_BNKADDRCMD_POSITION           0x00000008
#define _DDRCMD214_BNKADDRCMD_MASK               0x00000700
#define _DDRCMD214_BNKADDRCMD_LENGTH             0x00000003

#define _DDRCMD214_WAIT_POSITION                 0x0000000B
#define _DDRCMD214_WAIT_MASK                     0x000FF800
#define _DDRCMD214_WAIT_LENGTH                   0x00000009

#define _DDRCMD215_MDADDRHCMD_POSITION           0x00000000
#define _DDRCMD215_MDADDRHCMD_MASK               0x000000FF
#define _DDRCMD215_MDADDRHCMD_LENGTH             0x00000008

#define _DDRCMD215_BNKADDRCMD_POSITION           0x00000008
#define _DDRCMD215_BNKADDRCMD_MASK               0x00000700
#define _DDRCMD215_BNKADDRCMD_LENGTH             0x00000003

#define _DDRCMD215_WAIT_POSITION                 0x0000000B
#define _DDRCMD215_WAIT_MASK                     0x000FF800
#define _DDRCMD215_WAIT_LENGTH                   0x00000009

#define _DDRSCLSTART_SCLLBPASS_POSITION          0x00000000
#define _DDRSCLSTART_SCLLBPASS_MASK              0x00000001
#define _DDRSCLSTART_SCLLBPASS_LENGTH            0x00000001

#define _DDRSCLSTART_SCLUBPASS_POSITION          0x00000001
#define _DDRSCLSTART_SCLUBPASS_MASK              0x00000002
#define _DDRSCLSTART_SCLUBPASS_LENGTH            0x00000001

#define _DDRSCLSTART_SCLEN_POSITION              0x0000001A
#define _DDRSCLSTART_SCLEN_MASK                  0x04000000
#define _DDRSCLSTART_SCLEN_LENGTH                0x00000001

#define _DDRSCLSTART_SCLSTART_POSITION           0x0000001C
#define _DDRSCLSTART_SCLSTART_MASK               0x10000000
#define _DDRSCLSTART_SCLSTART_LENGTH             0x00000001

#define _DDRSCLSTART_SCLPHCAL_POSITION           0x0000001D
#define _DDRSCLSTART_SCLPHCAL_MASK               0x20000000
#define _DDRSCLSTART_SCLPHCAL_LENGTH             0x00000001

#define _DDRSCLLAT_CAPCLKDLY_POSITION            0x00000000
#define _DDRSCLLAT_CAPCLKDLY_MASK                0x0000000F
#define _DDRSCLLAT_CAPCLKDLY_LENGTH              0x00000004

#define _DDRSCLLAT_DDRCLKDLY_POSITION            0x00000004
#define _DDRSCLLAT_DDRCLKDLY_MASK                0x000000F0
#define _DDRSCLLAT_DDRCLKDLY_LENGTH              0x00000004

#define _DDRSCLCFG0_BURST8_POSITION              0x00000000
#define _DDRSCLCFG0_BURST8_MASK                  0x00000001
#define _DDRSCLCFG0_BURST8_LENGTH                0x00000001

#define _DDRSCLCFG0_DDR2_POSITION                0x00000001
#define _DDRSCLCFG0_DDR2_MASK                    0x00000002
#define _DDRSCLCFG0_DDR2_LENGTH                  0x00000001

#define _DDRSCLCFG0_RCASLAT_POSITION             0x00000004
#define _DDRSCLCFG0_RCASLAT_MASK                 0x000000F0
#define _DDRSCLCFG0_RCASLAT_LENGTH               0x00000004

#define _DDRSCLCFG0_ODTCSW_POSITION              0x00000018
#define _DDRSCLCFG0_ODTCSW_MASK                  0x01000000
#define _DDRSCLCFG0_ODTCSW_LENGTH                0x00000001

#define _DDRSCLCFG1_SCLCSEN_POSITION             0x00000000
#define _DDRSCLCFG1_SCLCSEN_MASK                 0x00000001
#define _DDRSCLCFG1_SCLCSEN_LENGTH               0x00000001

#define _DDRSCLCFG1_WCASLAT_POSITION             0x00000008
#define _DDRSCLCFG1_WCASLAT_MASK                 0x00000F00
#define _DDRSCLCFG1_WCASLAT_LENGTH               0x00000004

#define _DDRSCLCFG1_DBLREFDLY_POSITION           0x0000000C
#define _DDRSCLCFG1_DBLREFDLY_MASK               0x00001000
#define _DDRSCLCFG1_DBLREFDLY_LENGTH             0x00000001

#define _DDRPHYPADCON_ODTSEL_POSITION            0x00000000
#define _DDRPHYPADCON_ODTSEL_MASK                0x00000001
#define _DDRPHYPADCON_ODTSEL_LENGTH              0x00000001

#define _DDRPHYPADCON_ODTEN_POSITION             0x00000001
#define _DDRPHYPADCON_ODTEN_MASK                 0x00000002
#define _DDRPHYPADCON_ODTEN_LENGTH               0x00000001

#define _DDRPHYPADCON_DATDRVSEL_POSITION         0x00000002
#define _DDRPHYPADCON_DATDRVSEL_MASK             0x00000004
#define _DDRPHYPADCON_DATDRVSEL_LENGTH           0x00000001

#define _DDRPHYPADCON_ADDCDRVSEL_POSITION        0x00000003
#define _DDRPHYPADCON_ADDCDRVSEL_MASK            0x00000008
#define _DDRPHYPADCON_ADDCDRVSEL_LENGTH          0x00000001

#define _DDRPHYPADCON_ODTPDCAL_POSITION          0x00000004
#define _DDRPHYPADCON_ODTPDCAL_MASK              0x00000030
#define _DDRPHYPADCON_ODTPDCAL_LENGTH            0x00000002

#define _DDRPHYPADCON_ODTPUCAL_POSITION          0x00000006
#define _DDRPHYPADCON_ODTPUCAL_MASK              0x000000C0
#define _DDRPHYPADCON_ODTPUCAL_LENGTH            0x00000002

#define _DDRPHYPADCON_EOENCLKCYC_POSITION        0x00000008
#define _DDRPHYPADCON_EOENCLKCYC_MASK            0x00000100
#define _DDRPHYPADCON_EOENCLKCYC_LENGTH          0x00000001

#define _DDRPHYPADCON_NOEXTDLL_POSITION          0x00000009
#define _DDRPHYPADCON_NOEXTDLL_MASK              0x00000200
#define _DDRPHYPADCON_NOEXTDLL_LENGTH            0x00000001

#define _DDRPHYPADCON_WRCMDDLY_POSITION          0x0000000D
#define _DDRPHYPADCON_WRCMDDLY_MASK              0x00002000
#define _DDRPHYPADCON_WRCMDDLY_LENGTH            0x00000001

#define _DDRPHYPADCON_HALFRATE_POSITION          0x0000000E
#define _DDRPHYPADCON_HALFRATE_MASK              0x00004000
#define _DDRPHYPADCON_HALFRATE_LENGTH            0x00000001

#define _DDRPHYPADCON_DRVSTRNFET_POSITION        0x00000010
#define _DDRPHYPADCON_DRVSTRNFET_MASK            0x000F0000
#define _DDRPHYPADCON_DRVSTRNFET_LENGTH          0x00000004

#define _DDRPHYPADCON_DRVSTRPFET_POSITION        0x00000014
#define _DDRPHYPADCON_DRVSTRPFET_MASK            0x00F00000
#define _DDRPHYPADCON_DRVSTRPFET_LENGTH          0x00000004

