Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/include/proc/p32mz2064dah176.h
#define _GLCDCLUT16_RED_POSITION                 0x00000010
#define _GLCDCLUT16_RED_MASK                     0x00FF0000
#define _GLCDCLUT16_RED_LENGTH                   0x00000008

#define _GLCDCLUT17_BLUE_POSITION                0x00000000
#define _GLCDCLUT17_BLUE_MASK                    0x000000FF
#define _GLCDCLUT17_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT17_GREEN_POSITION               0x00000008
#define _GLCDCLUT17_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT17_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT17_RED_POSITION                 0x00000010
#define _GLCDCLUT17_RED_MASK                     0x00FF0000
#define _GLCDCLUT17_RED_LENGTH                   0x00000008

#define _GLCDCLUT18_BLUE_POSITION                0x00000000
#define _GLCDCLUT18_BLUE_MASK                    0x000000FF
#define _GLCDCLUT18_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT18_GREEN_POSITION               0x00000008
#define _GLCDCLUT18_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT18_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT18_RED_POSITION                 0x00000010
#define _GLCDCLUT18_RED_MASK                     0x00FF0000
#define _GLCDCLUT18_RED_LENGTH                   0x00000008

#define _GLCDCLUT19_BLUE_POSITION                0x00000000
#define _GLCDCLUT19_BLUE_MASK                    0x000000FF
#define _GLCDCLUT19_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT19_GREEN_POSITION               0x00000008
#define _GLCDCLUT19_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT19_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT19_RED_POSITION                 0x00000010
#define _GLCDCLUT19_RED_MASK                     0x00FF0000
#define _GLCDCLUT19_RED_LENGTH                   0x00000008

#define _GLCDCLUT20_BLUE_POSITION                0x00000000
#define _GLCDCLUT20_BLUE_MASK                    0x000000FF
#define _GLCDCLUT20_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT20_GREEN_POSITION               0x00000008
#define _GLCDCLUT20_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT20_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT20_RED_POSITION                 0x00000010
#define _GLCDCLUT20_RED_MASK                     0x00FF0000
#define _GLCDCLUT20_RED_LENGTH                   0x00000008

#define _GLCDCLUT21_BLUE_POSITION                0x00000000
#define _GLCDCLUT21_BLUE_MASK                    0x000000FF
#define _GLCDCLUT21_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT21_GREEN_POSITION               0x00000008
#define _GLCDCLUT21_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT21_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT21_RED_POSITION                 0x00000010
#define _GLCDCLUT21_RED_MASK                     0x00FF0000
#define _GLCDCLUT21_RED_LENGTH                   0x00000008

#define _GLCDCLUT22_BLUE_POSITION                0x00000000
#define _GLCDCLUT22_BLUE_MASK                    0x000000FF
#define _GLCDCLUT22_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT22_GREEN_POSITION               0x00000008
#define _GLCDCLUT22_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT22_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT22_RED_POSITION                 0x00000010
#define _GLCDCLUT22_RED_MASK                     0x00FF0000
#define _GLCDCLUT22_RED_LENGTH                   0x00000008

#define _GLCDCLUT23_BLUE_POSITION                0x00000000
#define _GLCDCLUT23_BLUE_MASK                    0x000000FF
#define _GLCDCLUT23_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT23_GREEN_POSITION               0x00000008
#define _GLCDCLUT23_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT23_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT23_RED_POSITION                 0x00000010
#define _GLCDCLUT23_RED_MASK                     0x00FF0000
#define _GLCDCLUT23_RED_LENGTH                   0x00000008

#define _GLCDCLUT24_BLUE_POSITION                0x00000000
#define _GLCDCLUT24_BLUE_MASK                    0x000000FF
#define _GLCDCLUT24_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT24_GREEN_POSITION               0x00000008
#define _GLCDCLUT24_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT24_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT24_RED_POSITION                 0x00000010
#define _GLCDCLUT24_RED_MASK                     0x00FF0000
#define _GLCDCLUT24_RED_LENGTH                   0x00000008

#define _GLCDCLUT25_BLUE_POSITION                0x00000000
#define _GLCDCLUT25_BLUE_MASK                    0x000000FF
#define _GLCDCLUT25_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT25_GREEN_POSITION               0x00000008
#define _GLCDCLUT25_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT25_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT25_RED_POSITION                 0x00000010
#define _GLCDCLUT25_RED_MASK                     0x00FF0000
#define _GLCDCLUT25_RED_LENGTH                   0x00000008

#define _GLCDCLUT26_BLUE_POSITION                0x00000000
#define _GLCDCLUT26_BLUE_MASK                    0x000000FF
#define _GLCDCLUT26_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT26_GREEN_POSITION               0x00000008
#define _GLCDCLUT26_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT26_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT26_RED_POSITION                 0x00000010
#define _GLCDCLUT26_RED_MASK                     0x00FF0000
#define _GLCDCLUT26_RED_LENGTH                   0x00000008

#define _GLCDCLUT27_BLUE_POSITION                0x00000000
#define _GLCDCLUT27_BLUE_MASK                    0x000000FF
#define _GLCDCLUT27_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT27_GREEN_POSITION               0x00000008
#define _GLCDCLUT27_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT27_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT27_RED_POSITION                 0x00000010
#define _GLCDCLUT27_RED_MASK                     0x00FF0000
#define _GLCDCLUT27_RED_LENGTH                   0x00000008

#define _GLCDCLUT28_BLUE_POSITION                0x00000000
#define _GLCDCLUT28_BLUE_MASK                    0x000000FF
#define _GLCDCLUT28_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT28_GREEN_POSITION               0x00000008
#define _GLCDCLUT28_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT28_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT28_RED_POSITION                 0x00000010
#define _GLCDCLUT28_RED_MASK                     0x00FF0000
#define _GLCDCLUT28_RED_LENGTH                   0x00000008

#define _GLCDCLUT29_BLUE_POSITION                0x00000000
#define _GLCDCLUT29_BLUE_MASK                    0x000000FF
#define _GLCDCLUT29_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT29_GREEN_POSITION               0x00000008
#define _GLCDCLUT29_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT29_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT29_RED_POSITION                 0x00000010
#define _GLCDCLUT29_RED_MASK                     0x00FF0000
#define _GLCDCLUT29_RED_LENGTH                   0x00000008

#define _GLCDCLUT30_BLUE_POSITION                0x00000000
#define _GLCDCLUT30_BLUE_MASK                    0x000000FF
#define _GLCDCLUT30_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT30_GREEN_POSITION               0x00000008
#define _GLCDCLUT30_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT30_GREEN_LENGTH                 0x00000008

